In [1]:
2 ** 5

32

In [2]:
def exponential(digit, exponent):
    value = digit ** exponent
    return value

In [3]:
print(exponential(3, 3))

27

In [4]:
import math
n = math.pow(3,3)
print(n)

27.0

In [8]:
# factorial (ex. 5! == 1x2x3x4x5)
math.factorial(5)

120

In [16]:
from math import sqrt, factorial
# 5의 root 를 계산하는 함수(sqrt)
n = sqrt(5)
n2 = factorial(5)
print(f"1 : {n}\n2 : {n2}")

1 : 2.23606797749979
2 : 120

In [17]:
from math import *
num = sqrt(5) + factorial(3)
print(num)

8.23606797749979

In [18]:
import math as dave
num = dave.factorial(5)
print(num)

120

In [19]:
from math import factorial as f
num = f(5)
print(num)

120

In [34]:
import pymysql
db = pymysql.connect(host="mariadb", port=3306, user="root", passwd="1234", db="devdb", charset="utf8")

In [38]:
cursor = db.cursor()

In [39]:
sql = """
    CREATE TABLE product(
        product_code varchar(20) NOT NULL PRIMARY KEY,
        title varchar(200) NOT NULL,
        ori_price int,
        discount_price int,
        delivery varchar(10)
    );
"""

In [40]:
cursor.execute(sql)

0

In [43]:
db.commit()

In [44]:
db.close()

In [46]:
import pymysql as ps
db = ps.connect(host="mariadb", port=3306, user="root", passwd="1234", db="devdb", charset="utf8")
cs = db.cursor()
sql = """
    create table korea(
        id int not null primary key,
        name varchar(20) not null,
        model_num varchar(10) not null,
        model_type varchar(10) not null
    );
"""
cs.execute(sql)
db.commit()
db.close()

In [67]:
import pymysql as ps
db = ps.connect(host="mariadb", port=3306, user="root", passwd="1234", db="devdb", charset="utf8")
cs = db.cursor()
for index in range(4):
    product_code = 20200420 + index + 1
    sql = """
        insert into product values ('""" + str(product_code) + """', "asdf", 20000, 20000, "A")
    """
    cs.execute(sql)
    
db.commit()
db.close()

In [70]:
import pymysql
db = pymysql.connect(host="mariadb", port=3306, user="root", passwd="1234", db="devdb", charset="utf8")
cursor = db.cursor()
sql = "select * from product;"
cursor.execute(sql)
 
result = cursor.fetchall()
#result = cursor.fetchone()


for record in result:
    print({record})
db.close()

{('20200415', 'asdf', 20000, 20000, 'A')}
{('20200416', 'asdf', 20000, 20000, 'A')}
{('20200421', 'asdf', 20000, 20000, 'A')}
{('20200422', 'asdf', 20000, 20000, 'A')}
{('20200423', 'asdf', 20000, 20000, 'A')}
{('20200424', 'asdf', 20000, 20000, 'A')}
{('20200425', 'asdf', 20000, 20000, 'A')}

In [73]:
import pymysql as ps
db = ps.connect(host="mariadb", port=3306, user="root", passwd="1234", db="devdb", charset="utf8")
cursor = db.cursor()
sql = """
    update product set delivery = 'B' where product_code = '20200416'
"""
cursor.execute(sql)
db.commit()
db.close()

In [74]:
import pymysql
db = pymysql.connect(host="mariadb", port=3306, user="root", passwd="1234", db="devdb", charset="utf8")
cursor = db.cursor()
sql = """ delete from product where product_code='20200425'"""
cursor.execute(sql)
db.commit()
db.close()

In [76]:
DROP SCHEMA IF EXISTS student_mgmt;
CREATE SCHEMA student_mgmt;
use student_mgmt;
DROP TABLE IF EXISTS students;
CREATE TABLE students(
    id TINYINT NOT NULL AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(10) NOT NULL,
    gender ENUM('man', 'woman') NOT NULL,
    birth DATE NOT NULL,
    english TINYINT NOT NULL,
    math TINYINT NOT NULL,
    korean TINYINT NOT NULL
);

INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('ray', 'man', '1989-08-15', 90, 80, 81);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('aaa', 'man', '1989-01-15', 80, 70, 82);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('bbb', 'woman', '1989-02-15', 70, 60, 83);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('ccc', 'man', '1989-03-15', 60, 50, 84);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('ddd', 'woman', '1989-04-15', 50, 40, 85);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('fff', 'man', '1989-05-15', 40, 30, 86);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('ggg', 'man', '1989-06-15', 30, 10, 87);

SyntaxError: invalid syntax (<ipython-input-76-1971c0d519d9>, line 1)

In [77]:
import pymysql
import pandas as pd

In [78]:
host_name = "mariadb"
host_port = 3306
username = 'root'
password = '1234'
database_name = 'student_mgmt'

In [79]:
db = pymysql.connect (
    host=host_name,
    port=host_port,
    user=username,
    passwd=password,
    db=database_name,
    charset='utf8'
)

In [80]:
sql = "show tables"

In [81]:
df = pd.read_sql(sql, db)

In [82]:
df

  Tables_in_student_mgmt
0               students

In [83]:
sql = "select * from students"
df = pd.read_sql(sql, db)
df

   id name gender       birth  english  math  korean
0   1  ray    man  1989-08-15       90    80      81
1   2  aaa    man  1989-01-15       80    70      82
2   3  bbb  woman  1989-02-15       70    60      83
3   4  ccc    man  1989-03-15       60    50      84
4   5  ddd  woman  1989-04-15       50    40      85
5   6  fff    man  1989-05-15       40    30      86
6   7  ggg    man  1989-06-15       30    10      87

In [85]:
# csv 파일 만들기
sql = "select * from students"
df = pd.read_sql(sql, db)
#df.to_csv('students.csv', sep=',', encoding='utf-8')
df.to_csv('students.csv', sep=',', index=False, encoding='utf-8')